Attribute VB_Name = "RegExpEx"
Option Explicit

'*/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
'*
'* [機能名] VBScript.RegExpラップ・拡張モジュール
'* [詳  細] VBScript.RegExpのWrapperとしての機能を提供する他、Scriptingを使用した
'*          ユーティリティを提供する。
'*          ラップするScriptingライブラリは以下のものとする。
'*              [name] Microsoft VBScript Regular Expressions 5.5
'*              [dll] C:\Windows\System32\vbscript.dll\3
'* [参  考]
'*  <https://docs.microsoft.com/ja-jp/previous-versions/windows/scripting/cc392403(v=msdn.10)?redirectedfrom=MSDN>
'*  <https://docs.microsoft.com/en-us/previous-versions//yab2dx62%28v%3dvs.85%29>
'*
'* @author Bankura
'* Copyright (c) 2019 Bankura
'*/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/

'******************************************************************************
'* Enum定義
'******************************************************************************

'*-----------------------------------------------------------------------------
'* なし。
'*
'*-----------------------------------------------------------------------------


'******************************************************************************
'* メソッド定義
'******************************************************************************
'なし。
