Attribute VB_Name = "ShellExTest"
Option Explicit

'*/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
'*
'* [機能名] ShellExテスト用モジュール
'* [詳  細] ShellExテスト用モジュール
'*
'* @author Bankura
'* Copyright (c) 2019 Bankura
'*/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/

'******************************************************************************
'* [概  要] ShellExStreamのTest。
'* [詳  細] ShellExStreamのTest用お試し処理。
'*
'******************************************************************************
Sub ShellExStreamTest()

End Sub


